[
  {
    "id": 1,
    "name": "equipment",
    "products": [
      {
        "id": 1,
        "name": "Gara Modular Sprint",
        "image": "",
        "serialNumber": "2456h45yh",
        "price": 129.95,
        "manufacturer": "Cressi",
        "tags": ["equipment", "fins"],
        "quantity": 100,
        "description": {
          "dateStart": "",
          "dateEnd": "",
          "detailShort": "This barefoot fin’s design is modeled after Cressi’s popular Gara Modular Impulse freediving fin",
          "detailLong": "This barefoot fin’s design is modeled after Cressi’s popular Gara Modular Impulse freediving fin, but the Sprint’s shorter length—28 inches long in size medium—and strong performance made it surprisingly suitable for scuba use. This fin really shines in flutter kick, where the razor-thin thermoplastic blade is very efficient, gliding easily through the water with just a small amount of effort and providing impressive propulsion when powering hard through open water. Snappy and responsive, this fin accelerates quickly and tracks straight even when kicking hard. It was our Testers Choice for barefoot fins."
        }
      },
      {
        "id": 2,
        "name": "Aquatics Tempo XT",
        "image": "",
        "serialNumber": "74r5hf6gr",
        "price": 329.95,
        "manufacturer": "Pinnacle",
        "tags": ["equipment", "wetsuit"],
        "quantity": 75,
        "description": {
          "dateStart": "",
          "dateEnd": "",
          "detailShort": "",
          "detailLong": "A body-hugging fit and a thick zipper flap limit water movement inside this suit. An interior merino wool lining offers additional insulation that allows the Tempo XT, and its female counterpart the Siren, to offer warmth and comfort beyond that of the average 3 mm suit. Smooth-skin seals at the wrist and ankles are comfortable and effective at limiting water entry. Flexible neoprene used throughout allows for an excellent range of motion. It was our Best Buy for 3 mm suits over $250."
        }
      },
      {
        "id": 3,
        "name": "Ti 3000",
        "image": "",
        "serialNumber": "kjh868mvf",
        "price": 2399.99,
        "manufacturer": "Seasoft",
        "tags": ["equipment", "drysuit"],
        "quantity": 10,
        "description": {
          "dateStart": "",
          "dateEnd": "",
          "details": "Made of 3.5 mm compressed neoprene with a titanium lining, this suit can be ordered with customized measurements, seals and booties at no extra charge. It impressed testers with an excellent fit, incredible comfort and a natural range of motion. It also scored very good for buoyancy and attitude control. A forearm-mounted exhaust valve is very accessible, allowing for easy, efficient venting. A long-zippered opening and flexible construction make the suit easy to don and doff. The Ti 3000 was our Testers Choice."
        }
      },
      {
        "id": 4,
        "name": "Hydros X",
        "image": "",
        "serialNumber": "390njjrs8",
        "price": 1159.0,
        "manufacturer": "Scubapro",
        "tags": ["equipment", "bcd"],
        "quantity": 50,
        "description": {
          "dateStart": "",
          "dateEnd": "",
          "details": "This BC impressed test divers with rock-solid stability and very good attitude control in all orientations. The wraparound harness is very comfortable and supportive, and features a two-position sternum strap and lightweight cushioning along the back and shoulder straps for additional comfort. Weight pockets are easy to load, and use both buckles and hook-and-loop closures to keep ballast secured. Zippered cargo pockets and several well-placed stainless D-rings offer plenty of carrying capacity. Comfortable and capable, it was our Best Buy for jacket BCs."
        }
      },
      {
        "id": 5,
        "name": "Peregrine",
        "image": "",
        "serialNumber": "89456krjh",
        "price": 495.0,
        "manufacturer": "Shearwater",
        "tags": ["equipment", "computer"],
        "quantity": 25,
        "description": {
          "dateStart": "",
          "dateEnd": "",
          "details": "A clean, data-rich layout and large colored characters contrasted on a black background make this computer’s large display very easy to read. Unmissable vibrating feedback is used to call attention to alerts. The two-button operation is intuitive and ergonomic, with clear on-screen prompts. Even with its large display, the Peregrine remains fairly ergonomic thanks to its thin, low-profile design. It was our Best Buy for dive computers over $450."
        }
      },
      {
        "id": 6,
        "name": "90L Roller",
        "image": "",
        "serialNumber": "oeirw4896",
        "price": 199.0,
        "manufacturer": "Apek",
        "tags": ["equipment", "bag"],
        "quantity": 20,
        "description": {
          "dateStart": "",
          "dateEnd": "",
          "details": "Even when stuffed to the gills, this bag’s streamlined dimensions, smooth roller wheels and multiple ergonomic grips make for easy wheeling, lifting and wrangling. Tough, water- shedding fabric and high-end hardware give the bag impressive durability, and a premium look and feel. Though compact, there’s enough space inside for everything a scuba diver might need for a weekend dive getaway. A large exterior pocket allows divers to keep clothing and dive gear separate. Easy-to-use external compression straps help cinch everything down and secure the load. The 90L Roller was our Best Buy for large roller bags."
        }
      }
    ]
  },
  {
    "id": 7,
    "name": "trips",
    "products": [
      {
        "id": 1,
        "name": "Dream Dive Menjangan 3",
        "image": "https://i.imgur.com/UGDKxCz.jpg",
        "serialNumber": "h486kfh34",
        "price": 1599.99,
        "manufacturer": "Mimpi Resort Menjangan",
        "tags": ["trip", "international", "under2000"],
        "quantity": 10,
        "description": {
          "dateStart": "May 25, 2022",
          "dateEnd": "May 30, 2022",
          "details": "Amazing walls, very healthy reef, and more than enough macro to satisfy the critter hunters. We offer a dedicated and experienced team, well-maintained equipment, and a passion for quality that combined puts safety as our number one priority. Located on the northwest coast of Bali, the Mimpi Resort Menjangan is a family-run resort nestled in a private inlet perfectly situated for diving the best of Bali’s northwestern dive sites. Traditional-style bungalows are dotted throughout peaceful waterfront grounds, with a restaurant looking over the beach, and small marina filled with traditional Balinese fishing boats."
        }
      },
      {
        "id": 8,
        "name": "Galapagos Photo Workshop",
        "image": "https://i.imgur.com/dCRT5o5.jpg",
        "serialNumber": "9hjiw5yhn",
        "price": 8800.0,
        "manufacturer": "Mark Strickland",
        "tags": ["trip", "international", "over2000"],
        "quantity": 7,
        "description": {
          "dateStart": "June 25, 2022",
          "dateEnd": "May 25, 2022",
          "details": "Join trip leader Mark Strickland for this perfectly crafted 10-night Galapagos liveaboard itinerary. We have carefully selected the best possible time of year when conditions are ideal for hammerheads, marine iguanas, Galapagos sharks, penguins, mantas, batfish, seahorses, and much more. An avid marine naturalist, Mark has discovered several nudibranch species. He is co-author and principle photographer for Lonely Planet’s award-winning book, “Diving and Snorkeling Thailand”. Mark's photos and articles have appeared in magazines and books around the world, including Action Asia, BBC Wildlife, National Geographic World, Natural History, Scuba Diving, Skin Diver, Sport Diver, Sportdiving, Unterwasser and many others."
        }
      }
    ]
  },
  {
    "id": 9,
    "name": "weddings",
    "products": [
      {
        "id": 9,
        "name": "Underwater Wedding",
        "image": "https://i.imgur.com/dnexSDl.jpg",
        "serialNumber": "9848y0w58",
        "price": 5000,
        "manufacturer": "SDD Chapel",
        "tags": ["wedding"],
        "quantity": 12,
        "description": {
          "dateStart": "",
          "dateEnd": "",
          "details": ""
        }
      }
    ]
  }
]
